# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/
# Даны три действительных числа
number1 = 2.5
number2 = 4.0
number3 = 1.8

# Проверяем каждое число на принадлежность интервалу (1, 3)
if 1 < number1 < 3:
    print(f"{number1} принадлежит интервалу (1, 3)")
else:
    print(f"{number1} не принадлежит интервалу (1, 3)")

if 1 < number2 < 3:
    print(f"{number2} принадлежит интервалу (1, 3)")
else:
    print(f"{number2} не принадлежит интервалу (1, 3)")

if 1 < number3 < 3:
    print(f"{number3} принадлежит интервалу (1, 3)")
else:
    print(f"{number3} не принадлежит интервалу (1, 3)")